<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"local","plan_modifier":"051a6df03c1b94ddb53b9a5329a560edecfe2c5bcd6a6a36ac0b75d175265fcb","backend":"a013df1d990c5a4b31d4873e20da6aca14217bc9b8a341aa768c317b754b6618","plan_job_ref":"Job Test plan target and replace #366 at https://github.com/dflook/terraform-github-actions/actions/runs/6683921720","plan_hash":"6d14485d1343658818df4b25f2450bc24cc332acdd2aa559f1c701ec917d635f","plan_text_format":"text","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-target-replace__
Replacing resources: `random_string.foreach["hello"]`, `random_string.count[0]`
With variables: `length = 10`
<details>
<summary>Plan: 2 to add, 0 to change, 2 to destroy. Changes to Outputs.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # random_string.count[0] will be replaced, as requested
-/+ resource "random_string" "count" {
      ~ id          = "**********" -> (known after apply)
      ~ result      = "**********" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # random_string.foreach["hello"] will be replaced, as requested
-/+ resource "random_string" "foreach" {
      ~ id          = "**********" -> (known after apply)
      ~ result      = "**********" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
  ~ count   = "hp46aV2trN" -> (known after apply)
  ~ foreach = "SSSFvuZaWm" -> (known after apply)
```
</details>

:memo: Plan generated in [Test plan target and replace #366](https://github.com/dflook/terraform-github-actions/actions/runs/6683921720)